import Link from "next/link";
import { useRef } from "react";

interface loginFormProps {
  loginHandler: (enteredLoginData: any) => Promise<void>;
}

const LoginForm: React.FC<loginFormProps> = ({ loginHandler }) => {
  const idInputRef = useRef<HTMLInputElement>(null);
  const pwInputRef = useRef<HTMLInputElement>(null);

  const loginHandleSubmit = (e: any) => {
    e.preventDefault();
    const enteredId = idInputRef.current?.value;
    const enteredPw = pwInputRef.current?.value;

    const loginData = {
      id: enteredId,
      pw: enteredPw,
    };
    loginHandler(loginData);
  };

  return (
    <div className="flex justify-center items-center  min-h-screen mx-auto">
      <div className="flex flex-col items-center bg-[#111111] px-20 py-11 rounded-[8px]">
        <h1>
          <Link href="/">
            <svg width="120" height="120" viewBox="0 0 120 120" fill="none" xmlns="http://www.w3.org/2000/svg">
              <path
                fill-rule="evenodd"
                clip-rule="evenodd"
                d="M105.432 43.595L39.6119 71.515C34.1319 73.84 29.5219 75 25.8069 75C21.6269 75 18.5819 73.525 16.7119 70.58C14.2869 66.78 15.3469 60.67 19.5069 54.22C21.9769 50.45 25.1169 46.99 28.1769 43.68C27.4569 44.85 21.1019 55.425 28.0519 60.405C29.4269 61.405 31.3819 61.895 33.7869 61.895C35.7169 61.895 37.9319 61.58 40.3669 60.945L105.432 43.595Z"
                fill="white"
              />
            </svg>
          </Link>
        </h1>
        <form onSubmit={loginHandleSubmit}>
          <div className="mb-6 relative">
            <label htmlFor="user_id" className=" absolute top-1/2 -translate-y-1/2 text-[#656565]">
              <svg className="inline-block ml-3 mr-2" width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                <path
                  d="M20.4 18.0003C20.403 16.8893 20.1843 15.7889 19.7568 14.7634C19.3293 13.738 18.7017 12.8082 17.9105 12.0283C17.8267 11.9451 17.7272 11.8791 17.6179 11.8343C17.5085 11.7895 17.3914 11.7666 17.2731 11.767C17.1549 11.7674 17.0379 11.7911 16.9288 11.8368C16.8197 11.8824 16.7207 11.9491 16.6374 12.033C16.554 12.1169 16.4881 12.2164 16.4432 12.3258C16.3983 12.4352 16.3755 12.5524 16.3759 12.6706C16.3763 12.7888 16.4 12.9058 16.4456 13.0149C16.4913 13.124 16.5579 13.223 16.6419 13.3064L16.642 13.3065C17.2626 13.9205 17.7551 14.6514 18.0912 15.4571C18.4273 16.2627 18.6003 17.127 18.6 17.9999V17.9999C18.6 18.1589 18.481 18.3754 18.1796 18.6213C17.8848 18.8617 17.4427 19.1074 16.8656 19.3279C15.7126 19.7685 14.0437 20.0999 12 20.0999C9.95638 20.0999 8.28747 19.7685 7.13452 19.3279C6.55737 19.1074 6.11529 18.8617 5.82053 18.6213C5.51912 18.3754 5.40005 18.1589 5.40005 17.9999L5.40005 17.9997C5.39888 17.1326 5.56862 16.2737 5.89955 15.4721C6.23048 14.6706 6.71612 13.9421 7.32871 13.3284L7.32893 13.3282C7.49655 13.1595 7.59064 12.9314 7.59064 12.6937C7.59064 12.4559 7.49655 12.2278 7.32893 12.0592L7.32893 12.0592L7.3283 12.0585C7.15967 11.8909 6.93156 11.7968 6.6938 11.7968C6.45603 11.7968 6.22792 11.8909 6.0593 12.0585L6.05928 12.0586C5.27653 12.8369 4.65609 13.7629 4.23394 14.7829C3.81182 15.8028 3.59636 16.8964 3.60005 18.0002C3.60019 19.3185 4.74777 20.2915 6.31969 20.928C7.905 21.5699 9.9877 21.8999 12 21.8999C14.0124 21.8999 16.0951 21.5699 17.6804 20.928C19.2523 20.2915 20.3998 19.3186 20.4 18.0003ZM20.4 18.0003L20.25 17.9999H20.4C20.4 18 20.4 18.0002 20.4 18.0003Z"
                  fill="#656565"
                  stroke="#656565"
                  stroke-width="0.3"
                />
                <path
                  d="M12 12.9C13.068 12.9 14.1121 12.5833 15.0001 11.9899C15.8881 11.3966 16.5802 10.5532 16.9889 9.56649C17.3977 8.57977 17.5046 7.49401 17.2962 6.44651C17.0879 5.39902 16.5736 4.43683 15.8184 3.68163C15.0632 2.92642 14.101 2.41212 13.0535 2.20376C12.006 1.9954 10.9202 2.10234 9.93351 2.51105C8.94679 2.91977 8.10342 3.6119 7.51006 4.49992C6.9167 5.38795 6.6 6.43198 6.6 7.5C6.6 8.93217 7.16893 10.3057 8.18162 11.3184C9.19432 12.3311 10.5678 12.9 12 12.9ZM12 3.9C12.712 3.9 13.408 4.11114 14.0001 4.50671C14.5921 4.90228 15.0535 5.46453 15.326 6.12234C15.5984 6.78016 15.6697 7.504 15.5308 8.20233C15.3919 8.90066 15.0491 9.54212 14.5456 10.0456C14.0421 10.5491 13.4007 10.8919 12.7023 11.0308C12.004 11.1697 11.2802 11.0984 10.6223 10.826C9.96453 10.5535 9.40228 10.0921 9.00671 9.50005C8.61114 8.90804 8.4 8.21201 8.4 7.5C8.4 6.54522 8.77928 5.62955 9.45442 4.95442C10.1295 4.27929 11.0452 3.9 12 3.9Z"
                  fill="#656565"
                  stroke="#656565"
                  stroke-width="0.3"
                />
              </svg>
            </label>
            <input type="text" name="" id="user_id" className="rounded-[8px] w-[400px] px-11 h-[52px]" required placeholder="아이디" ref={idInputRef} />
          </div>
          <div className="mb-6 relative">
            <label htmlFor="user_password" className=" absolute top-1/2 -translate-y-1/2 text-[#656565]">
              <svg className="inline-block ml-3 mr-2" width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                <g clip-path="url(#clip0_333_76)">
                  <path
                    d="M18 8H20C20.2652 8 20.5196 8.10536 20.7071 8.29289C20.8946 8.48043 21 8.73478 21 9V21C21 21.2652 20.8946 21.5196 20.7071 21.7071C20.5196 21.8946 20.2652 22 20 22H4C3.73478 22 3.48043 21.8946 3.29289 21.7071C3.10536 21.5196 3 21.2652 3 21V9C3 8.73478 3.10536 8.48043 3.29289 8.29289C3.48043 8.10536 3.73478 8 4 8H6V7C6 5.4087 6.63214 3.88258 7.75736 2.75736C8.88258 1.63214 10.4087 1 12 1C13.5913 1 15.1174 1.63214 16.2426 2.75736C17.3679 3.88258 18 5.4087 18 7V8ZM5 10V20H19V10H5ZM11 13H13V17H11V13ZM16 8V7C16 5.93913 15.5786 4.92172 14.8284 4.17157C14.0783 3.42143 13.0609 3 12 3C10.9391 3 9.92172 3.42143 9.17157 4.17157C8.42143 4.92172 8 5.93913 8 7V8H16Z"
                    fill="#656565"
                  />
                </g>
                <defs>
                  <clipPath id="clip0_333_76">
                    <rect width="24" height="24" fill="white" />
                  </clipPath>
                </defs>
              </svg>
            </label>
            <input type="password" id="user_password" className="rounded-[8px] w-[400px] px-11 h-[52px]" required placeholder="비밀번호" ref={pwInputRef}  autoComplete="current-password"/>
          </div>
          <button className="rounded-[8px] w-[400px] h-[52px]  box-border bg-white font-bold">로그인</button>
        </form>
        <ul className="login-util flex mt-3">
          <li>아이디 찾기</li>
          <li>비밀번호 찾기</li>
          <li>회원가입</li>
        </ul>
      </div>
    </div>
  );
};

export default LoginForm;
